{"total":4,"pageSize":10,"pageCount":1,"data":[{"title":"W3itch Weekly Telegraph Ep.3 —— Yume Nikki Online Project","slug":"W3itch-Weekly-Telegraph-Ep-3","date":"2022-05-10T02:00:40.000Z","updated":"2022-05-10T02:01:13.000Z","comments":true,"path":"api/articles/W3itch-Weekly-Telegraph-Ep-3.json","excerpt":"Yume Nikki and its Fan GamesYume Nikki Online ProjectEarly VersionYnoproject.net VersionYumeboo.r...","keywords":["w3itch"],"cover":"https://storageapi.fleek.co/andoroyur-team-bucket/metanetwork/users/metaio-storage/75c918a8-944f-4y-.-pngume.png","content":"<ul>\n<li>Yume Nikki and its Fan Games</li>\n<li>Yume Nikki Online Project\n<ul>\n<li>Early Version</li>\n<li><a href=\"http://Ynoproject.net\">Ynoproject.net</a> Version</li>\n<li><a href=\"http://Yumeboo.ru\">Yumeboo.ru</a> Version</li>\n</ul>\n</li>\n<li>EasyRPG Multiplayer Project</li>\n</ul>\n<h2 id=\"Yume-Nikki-and-its-Fan-Games\">Yume Nikki and its Fan Games</h2>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=H6vOJnQXdPs\">10 Best RPG Maker Games to Play on EasyRPG Player - Part 1</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=VOOYMxyx-mM\">10 Best RPG Maker Games to Play on EasyRPG Player - Part 2</a></li>\n</ul>\n<p>What are the best top 10 RPG Maker games? Everyone may have their answer in mind. Regardless of the ranking, I’m pretty sure Yume Nikki must have a place in this list.</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/6fc949cb-af84-4dbf-8d5a-e8d8a1e263dd\" alt=\"\"></p>\n<p>Yume Nikki (ゆめにっき, lit. Dream Diary) is an adventure game by pseudonymous Japanese developer Kikiyama. The player explore the dreams of the protagonist Madotsuki and encounter a number of surrealistic locations and creatures. The game was created using RPG Maker 2003, but lacks most elements commonly associated with role-playing games such as combat and quests. The game’s primary objective is to collect items known as “effects” that grant Madotsuki new abilities and allow the player to progress to new areas, with the game ending after 24 of them have been collected.</p>\n<p>The reception of the games are polarized. For those encountering Yume Nikki for their first time, the gameplay looks weird. The map and music filled with circulation, and the light is very dim in most cases. You could collect some items, but the vast majority of them are meaningless. This sense of emptiness builds the entire experience of the game, making you feel, at most moments in the game, that everything you do in the game is meaningless. But it is this sense of emptiness that is the most important experience in the entire game narrative, it creates a unique aesthetic that is hardly reconstruct by any other art form. (Perhaps in terms of the game experience, the most similar game before Yume Nikki is <a href=\"https://en.wikipedia.org/wiki/Serial_Experiments_Lain\">Serial Experiments Lain</a>, there is  even a doujin video called <a href=\"https://www.youtube.com/watch?v=dgiBRyn9UMs\">Yume Nikki Lain OP</a>.)</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/155c7924-e9b7-46fc-9991-5a1bade9d261\" alt=\"\"></p>\n<p>Like <a href=\"https://rpgmakerhistoria.home.blog/2021/12/05/a-history-on-rpg-maker-earthbound-likes-and-fan-games-part-one/\">Earthbound</a>, <a href=\"https://www.youtube.com/watch?v=4zptti2kJpk&amp;ab_channel=aDrive\">Pokemonn</a> and <a href=\"https://en.wikipedia.org/wiki/List_of_Touhou_Project_fangames\">Touhou Project</a>, Yume Nikki also has their own fan games community. Perhaps the most famous fan game among them is Yume 2kki (ゆめ 2 っき). Unlike the name implies, Yume 2kki is not a official sequel, this is a community-driven yume nikki fan game, the developers of the game for a group of people. The first release of Yume 2kki is in 2007, and like EasyRPG, it is still alive and active!</p>\n<p>Yume Nikki fan games also has a global community like RPG Maker. Every year, there are many excellent works born. They build wiki, bbs and blog to traced these fan games and their update. <a href=\"https://itch.io/jam/dream-diary-jam-5\">Dream Diary Jam</a> is an annual game jam about Yume Nikki fan games.</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/805e0589-fe99-429b-b3d2-6f05178f8992\" alt=\"\"></p>\n<p>In the words of Roland Barthes, sometimes <a href=\"https://en.wikipedia.org/wiki/The_Death_of_the_Author\">&quot;The Death of the Author&quot;</a> is a good thing for fans. Different from <a href=\"https://rpgmakerhistoria.home.blog/2021/12/05/a-history-on-rpg-maker-earthbound-likes-and-fan-games-part-one/\">Earthbound</a> and <a href=\"https://www.youtube.com/watch?v=4zptti2kJpk&amp;ab_channel=aDrive\">Pokemonn</a>, Yume Nikki itself is a free game, any one can download it for free. Because of this, those fan games maker have less constraint in designing their fan games. (Perhaps even fewer restrictions than <a href=\"https://en.wikipedia.org/wiki/List_of_Touhou_Project_fangames\">Touhou Project</a>.)</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=OhWFYMYRpcQ\">Why Nintendo Hates Fan Games</a></li>\n</ul>\n<h2 id=\"Yume-Nikki-Online-Project\">Yume Nikki Online Project</h2>\n<p>Ynoproject, which stands for Project Yume Nikki Online, is an open-source software based on EasyRPG. In addition to Yume Nikki and some of its derivatives, it can also run other works developed with RPG Maker 2000/2003 as well.</p>\n<h3 id=\"Early-Version\">Early Version</h3>\n<ul>\n<li><a href=\"hhttps://github.com/twig33/ynoclient\">Client</a></li>\n<li><a href=\"https://github.com/twig33/orbs\">Server</a></li>\n</ul>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/ecbb7565-b532-4d6d-9f58-0fc7bb59dd05\" alt=\"\"></p>\n<p>After open source the original version of ynoproject, its creator <a href=\"https://github.com/twig33\">twig33</a>, like Satoshi Nakamoto, disappeared from the Internet around Nov. 2021 after some minor bug fixes.</p>\n<p>The legacy code still inspires the community, since then, more and more developers have joined the development. There are two major versions of the client code exists today.</p>\n<h3 id=\"Ynoproject-net-Version\"><a href=\"http://Ynoproject.net\">Ynoproject.net</a> Version</h3>\n<ul>\n<li><a href=\"https://ynoproject.net/\">Website</a></li>\n<li><a href=\"https://github.com/ynoproject/ynoclient\">Client</a></li>\n<li><a href=\"https://github.com/ynoproject/ynoserver\">Server</a></li>\n</ul>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/38552e8d-b5e1-4925-8e50-51581694b75f\" alt=\"\"></p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/e37a1805-0834-42d9-b9f4-4a67ea118519\" alt=\"\"></p>\n<p>The versions with the largest number of players are from <a href=\"http://ynoproject.net\">ynoproject.net</a>.</p>\n<p>They have a well designed beautiful UI, a badge system that is being developed.</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/5c4b7626-a65d-4035-a336-10184bd94095\" alt=\"\"></p>\n<h3 id=\"Yumeboo-ru-Version\"><a href=\"http://Yumeboo.ru\">Yumeboo.ru</a> Version</h3>\n<ul>\n<li><a href=\"https://gaming.yumeboo.ru/\">Website</a></li>\n<li><a href=\"https://github.com/CataractJustice/ynoclient\">Client</a></li>\n<li><a href=\"https://gitlab.com/CataractJustice/YNOnline/\">Server</a></li>\n</ul>\n<p>Another version in developed by <a href=\"http://Yumeboo.ru\">Yumeboo.ru</a> at this discord. It has a in-game chat interface, and a completely rewritten server using nodejs that can be compiled once and deploy a bundle of games at the same time.</p>\n<h2 id=\"EasyRPG-Multiplayer-Project\">EasyRPG Multiplayer Project</h2>\n<p>Ynoproject brings a brand new gaming experience to the original Yume Nikki fan games.  <strong>Usually speaking, these games need to be explored by yourself, and sometimes this experience is a little bit lonely</strong> . Ynoproject makes them look more lively and less lonely, even though it may undermine the original author’s design intent. In ordr to maintain the original flavor of the fan games as much as possible, technically speaking the original Ynoproject just renders the avatar of other players in the map, does not involve any interaction between players, make it more like an online chat room.</p>\n<p>Some developers are beginning to think about the potential of this architecture, such as building virtual online spaces like meeting room, meetup event, game jam, and even NFT art galleries, make its experiences closer to those of traditional mmorpg games. Even adding more UGC elements to make it look like <a href=\"https://en.wikipedia.org/wiki/The_Sims\">The Sims</a>, <a href=\"https://en.wikipedia.org/wiki/Animal_Crossing\">Animal Crossing</a> and even <a href=\"\">Roblox</a>.</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/c969a6ec-21d8-431a-bf32-a1e4cc285e6e\" alt=\"\"></p>\n<p>Developers from both communities are collaborating and discussing this potential in this <a href=\"https://discord.gg/py4hYZnWMV\">discord channel</a>. They are trying to abstract the <a href=\"https://github.com/EasyRPG/Player/issues/2722\">API requirements in EasyRPG</a> in order to design a better architecture of EasyRPG Multiplayer Project in future.</p>\n<p>So is there any rpgmaker game with UGC content inside? In next week, we are going to introduced an ancient fan game of Harvest Moon serious in RPG maker 2003 so called <a href=\"https://w3itch.io/game/221\">Harvest moon – a new life</a>.</p>\n","raw":null,"categories":[],"tags":[]},{"title":"W3itch Weekly Telegraph Ep.2 —— EasyRPG","slug":"W3itch-Weekly-Telegraph-Ep-2","date":"2022-04-29T05:26:41.000Z","updated":"2022-04-29T05:27:13.000Z","comments":true,"path":"api/articles/W3itch-Weekly-Telegraph-Ep-2.json","excerpt":"In the last article, we introduced ourselves —— what w3itch is and what kind of problems we want ...","keywords":["w3itch"],"cover":"https://storageapi.fleek.co/andoroyur-team-bucket/metanetwork/users/metaio-storage/easyrpg-cover.png","content":"<p>In the last article, we introduced ourselves —— what w3itch is and what kind of problems we want to solve. Today, let’s have an introduction about what easyrpg is. Let’s go to <a href=\"https://easyrpg.org/about/\">their website</a> and try to find it out!</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/8a556fa4-7f69-485e-898d-0e237c3b7832\" alt=\"EasyRPG Homepage\"></p>\n<blockquote>\n<p>EasyRPG is a project that aims to create a free (as in freedom) cross-platform and multi-language Role Playing Game (RPG) creation tool, inspired by a commercial product called RPG Maker.</p>\n<p>The project is composed of several parts:</p>\n<ul>\n<li><a href=\"https://easyrpg.org/player/\">EasyRPG Player</a></li>\n<li><a href=\"https://easyrpg.org/rtp-replacement/\">RTP Replacement</a></li>\n<li><a href=\"https://easyrpg.org/tools/\">Tools</a></li>\n<li><a href=\"https://easyrpg.org/editor/\">EasyRPG Editor</a></li>\n</ul>\n<p>—— <a href=\"https://easyrpg.org/about/\">https://easyrpg.org/about/</a></p>\n</blockquote>\n<p>The most comprehensive module in the whole project so far is <a href=\"https://easyrpg.org/player/\">EasyRPG Player</a>, EasyRPG Player is a program that allows to play games created with RPG Maker 2000 and 2003. It has been in continuous development for <a href=\"https://blog.easyrpg.org/\">over 10 years</a>!</p>\n<ul>\n<li>Do you know which games are the most difficult to adapt?</li>\n<li><a href=\"https://wiki.easyrpg.org/development/technical-details/known-patches\">Do you know how many of any third-party patches for RPGMaker 2K/2k3?</a></li>\n<li><a href=\"https://github.com/EasyRPG/Player/issues/2474\">Do you know that the random map feature in 2k3 actually generates a different map each time during the runtime</a>?</li>\n</ul>\n<p>Like <a href=\"https://www.openttd.org/\">OpenTTD</a>, <a href=\"https://www.openra.net/\">OpenRA</a> and many other classical open source remake games, EasyRPG brings a better experience than the original one.</p>\n<p>Be aware EasyRPG is designed to support RPG Maker 2000 and 2003 only. There is a friend project called mkxp that is the equivalent for XP, VX and VX Ace. Check <a href=\"https://community.easyrpg.org/t/what-about-xp-support/1021\">this thread</a> to learn more.</p>\n<h2 id=\"Developer-Perks\">Developer Perks</h2>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=v4kx7yXRlig&amp;ab_channel=IndependentArt\">Easyrpg [RPG Maker 2000/2003 Player] - Developer Perks</a></li>\n</ul>\n<p>The above video summarized these advantages. Long story short, EasyRPG has those Developer Perks:</p>\n<ol>\n<li>Cross Platform.</li>\n<li>Press F to speed up by 3 times (Press G to 10X).</li>\n<li>No 256 colors restrictions any more.</li>\n<li>No CharSet size restrictions any more.</li>\n<li>Open Source</li>\n<li>Compatible with new versions of Windows</li>\n<li>Less Crash</li>\n<li>Compatible with OGG、Opus formats.</li>\n<li>Less Encoding problems.</li>\n</ol>\n<h2 id=\"Open-Source-Remake\">Open Source Remake</h2>\n<p>One of the most important perks I believe is open source. Many perks also came about because of open source. Those Open source project not only solves a bundle of compatibility issues, most of the times it also bring some brand new features and experience.</p>\n<p>Let’s take OpenTTD as an example, OpenTTD supports multiplayer games for up to 255 players between 15 different transport companies, and can be played both over a LAN or over the Internet. Each transport company is in competition with each other transport company, and each transport company can be controlled by more than one player at any time. This allows both co-operative and competitive multiplayer games. Competitive team games (e.g. two transport companies, each controlled by three players) are also possible. Further more, The game is also home to an active modding community, with community-made additions including new vehicles, trains and scenarios. Additional changes to the open source code which modify core game mechanics (“patches”) are also available.</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/f3f3c0c2-5499-4ee4-946e-c07ce9b12d33\" alt=\"\"></p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/5e19a0df-5d83-4dd9-baec-12134e3b141d\" alt=\"\"></p>\n<p>Because of it is open source, EasyRPG can be compiled to WASM by emscripten and running on web browser. Enables those games access like a more modern engines as RPG Player MV/MZ. (At this momonet, it is really hard to running RPG Player XP/VA/VX and Wolf RPG Games in web browser). And <a href=\"https://game.nicovideo.jp/atsumaru/search/tag/RPG%E3%83%84%E3%82%AF%E3%83%BC%E3%83%AB2003?link_in=gamepage_tag\">the most ironic story</a> from EasyRPG, is that Kadokawa (the current owner of RPG Maker and Nicovideo) uses EasyRPG on their online gaming platform.</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/ffb0d7ed-f38d-4ce8-9266-92755e46d413\" alt=\"\"></p>\n<p>Also because it is open source, there is a group of developer working on make it have some multiplayer game experience to like ynoproject.</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/2788b7b8-0bac-4861-ad03-cf5e0b70aab0\" alt=\"\"></p>\n<p><a href=\"https://hackmd.io/@E-5gxTGiSByBOKpvsaKa_g/SkShaIvHc\">Next week</a>, we are going to introduce what ynoproject is and the potential of EasyRPG Multiplayer. Stay turned.</p>\n","raw":null,"categories":[],"tags":[]},{"title":"W3itch Weekly Telegraph Ep.1 —— Beginning","slug":"W3itch-Weekly-Telegraph-Ep-1","date":"2022-04-22T20:30:22.000Z","updated":"2022-04-22T20:30:30.000Z","comments":true,"path":"api/articles/W3itch-Weekly-Telegraph-Ep-1.json","excerpt":"BirthWhy Game?Why RM2k/2k3?BirthAnd God said, Let there be light: and there was light.—— ...","keywords":["w3itch"],"cover":"https://storageapi.fleek.co/casimir-crystal-team-bucket/8291fd5c-7712-4e3a-b24f-25f17c489acf","content":"<ul>\n<li><a href=\"#Birth\">Birth</a></li>\n<li><a href=\"#Why-Game\">Why Game?</a></li>\n<li><a href=\"#Why-RM2k2k3\">Why RM2k/2k3?</a></li>\n</ul>\n<h2 id=\"Birth\">Birth</h2>\n<blockquote>\n<p>And God said, Let there be light: and there was light.</p>\n<p>—— <a href=\"https://en.wikipedia.org/wiki/Let_there_be_light\">Genesis 1:3</a></p>\n</blockquote>\n<p>If you’d like to cite a game website that best fits the spirit of indie games, and the ethos of open source software. I would definitely recommend you to take a look at <a href=\"http://itch.io\">itch.io</a>. If you are interested in <a href=\"https://en.wikipedia.org/wiki/Epic_Games_v._Apple\">the lawsuit between Epic and Apple</a>, you have probably heard this name. For those who are not familiar with it, <a href=\"http://itch.io\">itch.io</a> is a website for users to host, sell and download indie games. Released in March 2013 by Leaf Corcoran, the service hosts over 500,000 games and items (assets, ebooks, music) as of April 2022. <a href=\"http://Itch.io\">Itch.io</a> also allows users to host game jams, events where participants have limited time (usually 1–3 days) to create a game. <a href=\"http://Itch.io\">Itch.io</a> has also played its part in supporting <a href=\"https://itch.io/b/520/bundle-for-racial-justice-and-equality\">the racial justice and equality movement</a>, and <a href=\"https://itch.io/b/1316/bundle-for-ukraine\">the Ukraine War</a>.</p>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/8291fd5c-7712-4e3a-b24f-25f17c489acf\" alt=\"\"></p>\n<p>But at the same time, we also saw <a href=\"https://twitter.com/itchio/status/1490141815294414856\">this tweet:</a></p>\n<blockquote>\n<p>A few have asked about our stance on NFTs:</p>\n<p>NFTs are a scam. If you think they are legitimately useful for anything other than the exploitation of creators, financial scams, and the destruction of the planet the we ask that please reevaluate your life choices.</p>\n<p>Peace ✌️</p>\n<p>—— @itchio</p>\n</blockquote>\n<p>As developers who believing in this technology, it is worth mentioning that most of <a href=\"https://www.stephendiehl.com/blog/web3-bullshit.html\">the current stigmatizations of Web3 and Crypto</a> are not simply due to bias, but are true. We also believe that any debate is useless at this moment.</p>\n<blockquote>\n<p>Talk is cheap. Show me the code.</p>\n<p>—— Linus Torvalds</p>\n</blockquote>\n<p>But what do we get if <a href=\"http://itch.io\">itch.io</a> embraces with web3? Perhaps the only way to clarify our thoughts, as Linus Torvalds’ famouse quote, is to implement it. With this in mind, we start our journey that is now known as <a href=\"http://w3itch.io\">w3itch.io</a>.</p>\n<h2 id=\"Why-Game\">Why Game?</h2>\n<blockquote>\n<p>You can create art and beauty on a computer.</p>\n<p>—— Hackers: Heroes of the Computer Revolution</p>\n</blockquote>\n<p>Any era has its own form of art. In Ancient Greece we had epic poetry, in Renaissance we had painting, sculpture, literature and etcs. Although still controversial, <a href=\"https://en.wikipedia.org/wiki/Video_games_as_an_art_form\">video games could be seen as an art form</a>. Generations of game designers have been exploring the expression of game art. We have <a href=\"https://en.wikipedia.org/wiki/Metal_Gear_(video_game)\">Metal Gear</a>, <a href=\"https://en.wikipedia.org/wiki/The_Last_of_Us\">The Last of Us</a>, as well as <a href=\"https://en.wikipedia.org/wiki/Monument_Valley_(video_game)\">Monument Valley</a>, <a href=\"\">To the Moon</a> and <a href=\"https://en.wikipedia.org/wiki/Yume_Nikki\">Yume Nikki</a>. From one man’s independent work to a 3A masterpiece in game industry, each of them has their own unique aesthetic value and become a part of a common memory of our generation.</p>\n<p>Different from other art forms, games, like movies and open source software, need a group of people, even a game industry to achieve it, and even for indie games, it is an increasingly difficult to rely on just one man to get everything done. It will be a perfect place to experiment with web3 technologies as a way to solve <a href=\"https://www.ribbonfarm.com/2019/02/28/markets-are-eating-the-world/\">coordination scalability</a>.</p>\n<h2 id=\"Why-RM2k-2k3\">Why RM2k/2k3?</h2>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/80fa426c-098e-4086-bb47-d5f90e3b6927\" alt=\"\"></p>\n<p>The journey of a thousand miles begins with the first step, we decided to support RM2k/2k3 at the very beginning. There are several reasons for this:</p>\n<ul>\n<li>Retrogaming Culture: The first reason is, we all like old school <a href=\"https://en.wikipedia.org/wiki/Retrogaming\">retrogaming</a>, RM2k3 Restrict users to use 256 colors only. Make these works look stylized. Like <a href=\"https://archive.org/details/softwarelibrary_msdos_games\">MS-DOS</a> and <a href=\"https://archive.org/details/softwarelibrary_flash_games\">Flash Games</a>, some of these games as a cultural heritage, is being lost rapidly. Let them be in a new kind of medium could save and preserve this kind of cultural heritage for hour children.</li>\n</ul>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/24938924-c6c8-4121-be5c-faace3df80bc\" alt=\"\"></p>\n<ul>\n<li>Active global communities: Perhaps more than most of us could ever imagined, RM2k/2k3 has a global decentralized community that is still active today! In its birthplace Japan, probably one of the most active communities is <a href=\"https://mimidoshima.wordpress.com/2019/03/02/medetee/\">VIPRPG</a>, it is well known as hosts several Game Jam every year. <a href=\"http://Rpgmaker.net\">Rpgmaker.net</a> is one of the biggest community in English-spearking community, and people are still make new games based on this ancient game engine. We also have <a href=\"https://rmarchiv.de/games/1092\">rmarchiv.de</a>，<a href=\"https://www.rpg-atelier.net/index.php?site=showgame&amp;gid=729\">rpg-atelier.net</a> and <a href=\"http://www.rpg-studio.org/forum/index.php\">rpg-studio.org</a> in German. Some of the the coolest third party patch, was was born from here. We also have <a href=\"https://www.rpg-maker.fr/\">rpg-maker.fr</a> in France, <a href=\"https://rpg.blue/\">rpg.blue</a> in China mainland, <a href=\"https://sites.google.com/site/taiwanrpgplayer/home\">taiwanrpgplayer</a> in Taiwan, etcs and etcs. Each of them has their own unique flavor and culture.</li>\n</ul>\n<p><img src=\"https://storageapi.fleek.co/casimir-crystal-team-bucket/c7fe1eab-a71a-49df-8ed6-b6c4ee814e5f\" alt=\"\"></p>\n<p>But the most important reason is, we have easyrpg! This open source tool gives a new charm to this old school game engine. Next week, we are going to introducing easyrpg, and explain what we could been benefits from it.</p>\n","raw":null,"categories":[],"tags":[]},{"title":"What is w3itch.io?","slug":"What-is-w3itch-io","date":"2022-04-15T07:10:58.000Z","updated":"2022-04-15T07:11:08.000Z","comments":true,"path":"api/articles/What-is-w3itch-io.json","excerpt":"W3itch.io is a free as freedom open marketplace for independent game creators inspired by itch an...","keywords":["w3itch"],"cover":null,"content":"<p><a href=\"http://W3itch.io\">W3itch.io</a> is a free as freedom open marketplace for independent game creators inspired by <a href=\"https://itch.io/\">itch</a> and <a href=\"https://gitcoin.co/\">gitcoin</a>.</p>\n<p>It’s a community that enables anyone to sell the content they’ve created. As a seller you’re in charge of how it’s done: you set the</p>\n<p>price, you run sales, and you design your pages. Benefit from decentralized storage technology, it’s never necessary to get votes,likes, or follows to get your content approved, and you can make changesto how you distribute your work as frequently as you <a href=\"http://like.W3itch.io\">like.W3itch.io</a> is also a collection of some of the most unique, interesting, and independent creations you’ll find on the web. We’re not your typical digital storefront, with a wide range of both paid and free content, we encourage you to look around and see what you find. Unlike itch, w3itch focus on putting status-of-quote web3 technology into production level services, that is, the community will be encouraged to use web3 technologies such as did, nft, decentralized storage, social token, direct cryptocurrency payment and etcs.</p>\n","raw":null,"categories":[],"tags":[]}]}